giltal/MakersPlatfrom/Drivers/ESP32_GB_EMU/ESP32_GB_EMU.cpp
#include "ESP32_GB_EMU.h"
#include "SPI.h"
#include "graphics.h"
#include <GeneralLib.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <Arduino.h>

////// SDL
#define GAMEBOY_HEIGHT 160
#define GAMEBOY_WIDTH 144
unsigned char pixels[GAMEBOY_HEIGHT * GAMEBOY_WIDTH];

extern ILI9488SPI_8C lcd;
extern analogJoyStick JS;
extern Adafruit_FT6206 ts;

static int button_start, button_select, button_a, button_b, button_down, button_up, button_left, button_right;

unsigned char getColorIndexFromFrameBuffer(int x, int y)
{
	int offset = x + y * 160;
	return pixels[offset];
}

const int color[] = { 0x000000, 0x555555, 0xAAAAAA, 0xFFFFFF };
//unsigned char conversionTable[4] = { 0x0,0x12,0x36,0x3f }; // Dark
unsigned char conversionTable[4] = { 0x3f,0x12,0x36,0x00 }; // White
unsigned char tempLCDbuffer[160];

void sdl_init(void)
{

}

int sdl_update(void)
{
	return 0;
}

#define MP_BUTTON_A	27
#define MP_BUTTON_B	33

unsigned int sdl_get_buttons(void)
{
	unsigned short x, y, x2, y2;
	button_a = digitalRead(MP_BUTTON_A);
	button_b = digitalRead(MP_BUTTON_B);
	button_select = 0x4;
	button_start = 0x8;
	if (TOUCH_PANNEL_TOUCHED())
	{
		ts.getTouchedPoints(&x, &y, &x2, &y2);
		if (x > 320 && x < 480)
		{
			button_select = 0;
		}
		else if (x > 0 && x < 80)
		{
			button_start = 0;
		}
	}

	return button_start | button_select | (button_b << 1) | button_a;
}

unsigned int sdl_get_directions(void)
{
	int x, y;
	x = JS.readXaxis();
	y = JS.readYaxis();

	//printf("x %d y %d\n", x, y);
	button_right = 0x1;
	if (x > 500)
	{
		button_right = 0;
	}
	button_left = 0x2;
	if (x < -500)
	{
		button_left = 0;
	}
	button_up = 0x4;
	if (y < -500)
	{
		button_up = 0;
	}
	button_down = 0x8;
	if (y > 500)
	{
		button_down = 0;
	}

	return button_down | button_up | button_left | button_right;
}

unsigned char* sdl_get_framebuffer(void)
{
	return pixels;
}

void flushFrameToLCD(void)
{
	short i, j;
	int offset;
	lcd.setXY(80, 16, 399, 303);
	for (i = 0; i < GAMEBOY_WIDTH; i++)
	{
		offset = i * 160;
		for (j = 0; j < GAMEBOY_HEIGHT; j++)
		{
			tempLCDbuffer[j] = conversionTable[pixels[offset + j]];
			pixels[offset + j] = 0;
		}
		SPI.writeBuffer((unsigned int*)tempLCDbuffer, 40);
		SPI.writeBuffer((unsigned int*)tempLCDbuffer, 40);
	}
}

////// ROM
const unsigned char *bytes;
unsigned int mapper;

static char *banks[] =
{
	" 32KiB",
	" 64KiB",
	"128KiB",
	"256KiB",
	"512KiB",
	"  1MiB",
	"  2MiB",
	"  4MiB",
	/* 0x52 */
	"1.1MiB",
	"1.2MiB",
	"1.5MiB",
	"Unknown"
};

static char *rams[] = {
	"None",
	"  2KiB",
	"  8KiB",
	" 32KiB",
	"Unknown"
};

static char *regions[] = {
	"Japan",
	"Non-Japan",
	"Unknown"
};

static unsigned char header[] = {
	0xCE, 0xED, 0x66, 0x66, 0xCC, 0x0D, 0x00, 0x0B,
	0x03, 0x73, 0x00, 0x83, 0x00, 0x0C, 0x00, 0x0D,
	0x00, 0x08, 0x11, 0x1F, 0x88, 0x89, 0x00, 0x0E,
	0xDC, 0xCC, 0x6E, 0xE6, 0xDD, 0xDD, 0xD9, 0x99,
	0xBB, 0xBB, 0x67, 0x63, 0x6E, 0x0E, 0xEC, 0xCC,
	0xDD, 0xDC, 0x99, 0x9F, 0xBB, 0xB9, 0x33, 0x3E
};

int rom_init(const unsigned char *rombytes)
{
	char buf[17];
	int type, bank_index, ram, region, version, i, pass;
	unsigned char checksum = 0;

	if (memcmp(&rombytes[0x104], header, sizeof(header)) != 0)
		return 0;

	memcpy(buf, &rombytes[0x134], 16);
	buf[16] = '\0';
	printf("Rom title: %s\n", buf);

	type = rombytes[0x147];

	bank_index = rombytes[0x148];
	/* Adjust for the gap in the bank indicies */
	if (bank_index >= 0x52 && bank_index <= 0x54)
		bank_index -= 74;
	else if (bank_index > 7)
		bank_index = 11;

	printf("Rom size: %s\n", banks[bank_index]);

	ram = rombytes[0x149];
	if (ram > 3)
		ram = 4;

	printf("RAM size: %s\n", rams[ram]);

	region = rombytes[0x14A];
	if (region > 2)
		region = 2;
	printf("Region: %s\n", regions[region]);

	version = rombytes[0x14C];
	printf("Version: %02X\n", version);

	for (i = 0x134; i <= 0x14C; i++)
		checksum = checksum - rombytes[i] - 1;

	pass = rombytes[0x14D] == checksum;

	printf("Checksum: %s (%02X)\n", pass ? "OK" : "FAIL", checksum);
	if (!pass)
		return 0;

	bytes = rombytes;

	switch (type)
	{
	case 0x00:
	case 0x08:
	case 0x09:
		mapper = NROM;
		break;
	case 0x01:
	case 0x02:
	case 0x03:
		mapper = MBC1;
		break;
	case 0x05:
	case 0x06:
		mapper = MBC2;
		break;
	case 0x0B:
	case 0x0C:
		mapper = MMM01;
		break;
	case 0x0F:
	case 0x10:
	case 0x11:
	case 0x12:
	case 0x13:
		mapper = MBC3;
		break;
	case 0x15:
	case 0x16:
	case 0x17:
		mapper = MBC4;
		break;
	case 0x19:
	case 0x1A:
	case 0x1B:
	case 0x1C:
	case 0x1D:
	case 0x1E:
		mapper = MBC5;
		break;
	}

	return 1;
}

unsigned int rom_get_mapper(void)
{
	return mapper;
}

int rom_load(const char *filename)
{
	return 0;
}

const unsigned char *rom_getbytes(void)
{
	return bytes;
}

////// MEM
//GBmemory	GBmem;
unsigned char * GBmem;
unsigned char * SecROMbank,* ROMbank2,* ROMbank3;
static int DMA_pending = 0;
static unsigned char joypad_select_buttons, joypad_select_directions;

void mem_bank_switch(unsigned int n)
{
	const unsigned char *b = rom_getbytes();
	//memcpy(&GBmem[0x4000], &b[n * 0x4000], 0x4000);
	switch (n)
	{
	case 1:
		SecROMbank = &GBmem[0x4000];
		break;
	/*case 2:
		SecROMbank = ROMbank2;
		break;
	case 3:
		SecROMbank = ROMbank3;
		break;*/
	default: // n > 3 - connect directly to ROM
		SecROMbank = (unsigned char*)&b[n * 0x4000];
		break;
	}
}

/* LCD's access to VRAM */
unsigned char mem_get_raw(unsigned short p)
{
	return GBmem[p];
}

unsigned char mem_get_byte(unsigned short i)
{
	unsigned long elapsed;
	unsigned char mask = 0xF;

	if (DMA_pending && i < 0xFF80)
	{
		elapsed = cpu_get_cycles() - DMA_pending;
		if (elapsed >= 160)
			DMA_pending = 0;
		else
		{
			return GBmem[0xFE00 + elapsed];
		}
	}

	if (i >= 0x4000 && i <= 0x8000)
	{
		return SecROMbank[i - 0x4000];
	}

	if (i < 0xFF00)
		return GBmem[i];
	switch (i)
	{
	case 0xFF00:	/* Joypad */
		mask = 0xf;
		if (!joypad_select_directions)
			mask = sdl_get_directions();
		else if (!joypad_select_buttons)
			mask = sdl_get_buttons();
		return mask | joypad_select_buttons | joypad_select_directions;
		break;
	case 0xFF04:
		return timer_get_div();
		break;
	case 0xFF05:
		return timer_get_counter();
		break;
	case 0xFF06:
		return timer_get_modulo();
		break;
	case 0xFF07:
		return timer_get_tac();
		break;
	case 0xFF0F:
		return interrupt_get_IF();
		break;
	case 0xFF41:
		return lcd_get_stat();
		break;
	case 0xFF44:
		return lcd_get_line();
		break;
	case 0xFF4D:	/* GBC speed switch */
		return 0xFF;
		break;
	case 0xFFFF:
		return interrupt_get_mask();
		break;
	}

