giltal/MakersPlatfrom/Drivers/ESP32_GB_EMU/ESP32_GB_EMU.cpp
	return GBmem[i];
}

unsigned short mem_get_word(unsigned short i)
{
	unsigned long elapsed;

	if (DMA_pending && i < 0xFF80)
	{
		elapsed = cpu_get_cycles() - DMA_pending;
		if (elapsed >= 160)
			DMA_pending = 0;
		else
		{
			return GBmem[0xFE00 + elapsed];
		}
	}
	if (i >= 0x4000 && i<= 0x8000)
	{
		return SecROMbank[i-0x4000] | (SecROMbank[i - 0x4000 + 1] << 8);
	}
	else
		return GBmem[i] | (GBmem[i + 1] << 8);
}

void mem_write_byte(unsigned short d, unsigned char i)
{
	unsigned int filtered = 0;

	switch (rom_get_mapper())
	{
	case NROM:
		if (d < 0x8000)
			filtered = 1;
		break;
	case MBC2:
	case MBC3:
		filtered = MBC3_write_byte(d, i);
		break;
	case MBC1:
		filtered = MBC1_write_byte(d, i);
		break;
	}

	if (filtered)
		return;

	switch (d)
	{
	case 0xFF00:	/* Joypad */
		joypad_select_buttons = (i & 0x20);
		joypad_select_directions = (i & 0x10);
		break;
	case 0xFF01: /* Link port data */
		break;
	case 0xFF04:
		timer_set_div(i);
		break;
	case 0xFF05:
		timer_set_counter(i);
		break;
	case 0xFF06:
		timer_set_modulo(i);
		break;
	case 0xFF07:
		timer_set_tac(i);
		break;
	case 0xFF0F:
		interrupt_set_IF(i);
		break;
	case 0xFF40:
		lcd_write_control(i);
		break;
	case 0xFF41:
		lcd_write_stat(i);
		break;
	case 0xFF42:
		lcd_write_scroll_y(i);
		break;
	case 0xFF43:
		lcd_write_scroll_x(i);
		break;
	case 0xFF45:
		lcd_set_ly_compare(i);
		break;
	case 0xFF46: /* OAM DMA */
		/* Copy bytes from i*0x100 to OAM */
		memcpy(&GBmem[0xFE00], &GBmem[i * 0x100], 0xA0);
		DMA_pending = cpu_get_cycles();
		break;
	case 0xFF47:
		lcd_write_bg_palette(i);
		break;
	case 0xFF48:
		lcd_write_spr_palette1(i);
		break;
	case 0xFF49:
		lcd_write_spr_palette2(i);
		break;
	case 0xFF4A:
		lcd_set_window_y(i); break;
	case 0xFF4B:
		lcd_set_window_x(i); break;
	case 0xFFFF:
		interrupt_set_mask(i);
		return;
		break;
	}

	GBmem[d] = i;
}

void mem_write_word(unsigned short d, unsigned short i)
{
	GBmem[d] = i & 0xFF;
	GBmem[d + 1] = i >> 8;
}

extern unsigned int gb_rom_size;

unsigned int mem_init()
{
	const unsigned char *bytes = rom_getbytes();

	bool res = 1;
	//res = GBmem.init();
	GBmem = (unsigned char*)malloc(0x10000);
	if (GBmem == 0)
	{
		return 0;
	}

	/*if (gb_rom_size > 32*1024)
	{
		ROMbank2 = (unsigned char*)malloc(0x4000);
		ROMbank3 = (unsigned char*)malloc(0x4000);
		if (ROMbank2 == 0 || ROMbank3 == 0)
		{
			return 0;
		}
	}*/

	memcpy(&GBmem[0x0000], &bytes[0x0000], 0x4000);
	memcpy(&GBmem[0x4000], &bytes[0x4000], 0x4000);
	/*if (gb_rom_size > 32 * 1024)
	{
		memcpy(ROMbank2, &bytes[0x8000], 0x4000);
		memcpy(ROMbank3, &bytes[0xC000], 0x4000);
	}*/
	SecROMbank = &GBmem[0x4000];

	GBmem[0xFF10] = 0x80;
	GBmem[0xFF11] = 0xBF;
	GBmem[0xFF12] = 0xF3;
	GBmem[0xFF14] = 0xBF;
	GBmem[0xFF16] = 0x3F;
	GBmem[0xFF19] = 0xBF;
	GBmem[0xFF1A] = 0x7F;
	GBmem[0xFF1B] = 0xFF;
	GBmem[0xFF1C] = 0x9F;
	GBmem[0xFF1E] = 0xBF;
	GBmem[0xFF20] = 0xFF;
	GBmem[0xFF23] = 0xBF;
	GBmem[0xFF24] = 0x77;
	GBmem[0xFF25] = 0xF3;
	GBmem[0xFF26] = 0xF1;
	GBmem[0xFF40] = 0x91;
	GBmem[0xFF47] = 0xFC;
	GBmem[0xFF48] = 0xFF;
	GBmem[0xFF49] = 0xFF;

	if (res)
		return (unsigned int)GBmem;
	else
		return 0x0;
}

#define __1KB 1024
bool GBmemory::init()
{
	ROMbank0 = (unsigned char *)malloc(__1KB * 16);
	if (ROMbank0 == NULL)
		return false;

	ROMbank1 = (unsigned char *)malloc(__1KB * 16);
	if (ROMbank1 == NULL)
	{
		delete ROMbank0;
		return false;
	}

	VRAM = (unsigned char *)malloc(__1KB * 8);
	if (VRAM == NULL)
	{
		delete ROMbank0;
		delete ROMbank1;
		return false;
	}

	ExternalRAM = (unsigned char *)malloc(__1KB * 8);
	if (ExternalRAM == NULL)
	{
		delete ROMbank0;
		delete ROMbank1;
		delete VRAM;
		return false;
	}

	WorkRAM = (unsigned char *)malloc(__1KB * 8);
	if (WorkRAM == NULL)
	{
		delete ROMbank0;
		delete ROMbank1;
		delete VRAM;
		delete ExternalRAM;
		return false;
	}

	return true;
}

unsigned char & GBmemory::operator[](unsigned short const address)
{
	if ((address >= 0) && (address < 0x4000))
	{
		return ROMbank0[address];
	}
	if ((address >= 0x4000) && (address < 0x8000))
	{
		return ROMbank1[address - 0x4000];
	}
	if ((address >= 0x8000) && (address < 0xA000))
	{
		return VRAM[address - 0x8000];
	}
	if ((address >= 0xA000) && (address < 0xC000))
	{
		return ExternalRAM[address - 0xA000];
	}
	if ((address >= 0xC000) && (address < 0xE000))
	{
		return WorkRAM[address - 0xC000];
	}
	if ((address >= 0xE000) && (address <= 0xFDFF))
	{
		return WorkRAM[address - 0xC000];
	}
	if ((address >= 0xFE00) && (address <= 0xFE9F))
	{
		return OAM[address - 0xFE00];
	}
	if ((address >= 0xFF00) && (address <= 0xFF7F))
	{
		return IOports[address - 0xFF00];
	}
	if ((address >= 0xFF80) && (address <= 0xFFFE))
	{
		return HRAM[address - 0xFF80];
	}
	if (address == 0xffff)
	{
		return InterruptEnableRegister[0];
	}
}

////// MBC
enum {
	NO_FILTER_WRITE,
	FILTER_WRITE
};

static unsigned int bank_upper_bits;
static unsigned int ram_select;

/* Unfinished, no clock etc */
unsigned int MBC3_write_byte(unsigned short d, unsigned char i)
{
	int bank;

	if (d < 0x2000)
	{
		return FILTER_WRITE;
	}

	if (d < 0x4000)
	{
		bank = i & 0x7F;

		if (bank == 0)
			bank++;

		mem_bank_switch(bank);

		return FILTER_WRITE;
	}

	if (d < 0x8000)
		return FILTER_WRITE;

	return NO_FILTER_WRITE;
}
unsigned int MBC1_write_byte(unsigned short d, unsigned char i)
{
	int bank;

	if (d < 0x2000)
	{
		return FILTER_WRITE;
		/* TODO: Enable/disable SRAM */
	}

	/* Switch rom bank at 4000-7fff */
	if (d >= 0x2000 && d < 0x4000)
	{
		/* Bits 0-4 come from the value written to memory here,
		 * bits 5-6 come from a seperate write to 4000-5fff if
		 * RAM select is 1.
		 */
		bank = i & 0x1F;
		if (!ram_select)
			bank |= bank_upper_bits;

		/* "Writing to this address space selects the lower 5 bits of the
		 * ROM Bank Number (in range 01-1Fh). When 00h is written, the MBC
		 * translates that to bank 01h also."
		 * http://nocash.emubase.de/pandocs.htm#mbc1max2mbyteromandor32kbyteram
		 */

		if (bank == 0 || bank == 0x20 || bank == 0x40 || bank == 0x60)
			bank++;

