giltal/MakersPlatfrom/Drivers/ESP32_GB_EMU/ESP32_GB_EMU.cpp
		mem_bank_switch(bank);

		return FILTER_WRITE;
	}

	/* Bit 5 and 6 of the bank selection */
	if (d >= 0x4000 && d < 0x6000)
	{
		bank_upper_bits = (i & 0x3) << 5;
		return FILTER_WRITE;
	}

	if (d >= 0x6000 && d <= 0x7FFF)
	{
		ram_select = i & 1;
		return FILTER_WRITE;
	}
	return NO_FILTER_WRITE;
}

////// LCD
static int lcd_line = 0;
static int lcd_ly_compare;

/* LCD STAT */
static int ly_int;	/* LYC = LY coincidence interrupt enable */
static int mode2_oam_int;
static int mode1_vblank_int;
static int mode0_hblank_int;
static int ly_int_flag;
static int lcd_mode;

/* LCD Control */
static int lcd_enabled;
static int window_tilemap_select;
static int window_enabled;
static int tilemap_select;
static int bg_tiledata_select;
static int sprite_size;
static int sprites_enabled;
static int bg_enabled;
static int scroll_x, scroll_y;
static int window_x, window_y;

//static unsigned char bgpalette[] = { 3, 2, 1, 0 };
static unsigned char bgpalette[] = { 0, 1, 2, 3 };
static unsigned char sprpalette1[] = { 0, 1, 2, 3 };
static unsigned char sprpalette2[] = { 0, 1, 2, 3 };
//static unsigned long colours[4] = { 0xFFFFFF, 0xC0C0C0, 0x808080, 0x000000 };
static unsigned long colours[4] = { 0, 1, 2, 3 };

struct sprite {
	int y, x, tile, flags;
};

enum {
	PRIO = 0x80,
	VFLIP = 0x40,
	HFLIP = 0x20,
	PNUM = 0x10
};

unsigned char lcd_get_stat(void)
{
	return (ly_int) << 6 | lcd_mode;
}

void lcd_write_bg_palette(unsigned char n)
{
	bgpalette[0] = (n >> 0) & 3;
	bgpalette[1] = (n >> 2) & 3;
	bgpalette[2] = (n >> 4) & 3;
	bgpalette[3] = (n >> 6) & 3;
}

void lcd_write_spr_palette1(unsigned char n)
{
	sprpalette1[0] = 0;
	sprpalette1[1] = (n >> 2) & 3;
	sprpalette1[2] = (n >> 4) & 3;
	sprpalette1[3] = (n >> 6) & 3;
}

void lcd_write_spr_palette2(unsigned char n)
{
	sprpalette2[0] = 0;
	sprpalette2[1] = (n >> 2) & 3;
	sprpalette2[2] = (n >> 4) & 3;
	sprpalette2[3] = (n >> 6) & 3;
}

void lcd_write_scroll_x(unsigned char n)
{
	//	printf("x scroll changed to %02x\n", n);
	scroll_x = n;
}

void lcd_write_scroll_y(unsigned char n)
{
	scroll_y = n;
}

int lcd_get_line(void)
{
	return lcd_line;
}

void lcd_write_stat(unsigned char c)
{
	ly_int = !!(c & 0x40);
}

void lcd_write_control(unsigned char c)
{
	//	printf("LCDC set to %02x\n", c);
	//	cpu_print_debug();
	bg_enabled = !!(c & 0x01);
	sprites_enabled = !!(c & 0x02);
	sprite_size = !!(c & 0x04);
	tilemap_select = !!(c & 0x08);
	bg_tiledata_select = !!(c & 0x10);
	window_enabled = !!(c & 0x20);
	window_tilemap_select = !!(c & 0x40);
	lcd_enabled = !!(c & 0x80);
}

void lcd_set_ly_compare(unsigned char c)
{
	lcd_ly_compare = c;
}

void lcd_set_window_y(unsigned char n) {
	window_y = n;
}

void lcd_set_window_x(unsigned char n) {
	window_x = n;
}

static void swap(struct sprite *a, struct sprite *b)
{
	struct sprite c;

	c = *a;
	*a = *b;
	*b = c;
}

static void sort_sprites(struct sprite *s, int n)
{
	int swapped, i;

	do
	{
		swapped = 0;
		for (i = 0; i < n - 1; i++)
		{
			if (s[i].x < s[i + 1].x)
			{
				swap(&s[i], &s[i + 1]);
				swapped = 1;
			}
		}
	} while (swapped);
}

void drawColorIndexToFrameBuffer(int x, int y, unsigned char idx, unsigned char *b) {
	int offset = x + y * 160;
	b[offset] = idx;
}

static void draw_bg_and_window(unsigned char *b, int line)
{
	int x, offset = line * 160;

	for (x = 0; x < 160; x++)
	{
		unsigned int map_select, map_offset, tile_num, tile_addr, xm, ym;
		unsigned char b1, b2, mask, colour;

		/* Convert LCD x,y into full 256*256 style internal coords */
		if (line >= window_y && window_enabled && line - window_y < 144)
		{
			xm = x;
			ym = line - window_y;
			map_select = window_tilemap_select;
		}
		else
		{
			if (!bg_enabled)
			{
				//drawColorIndexToFrameBuffer(x,line,0,b);
				b[offset + x] = 0;
				return;
			}
			//a mod 2i = a & (2i–1)
			//xm = (x + scroll_x)%256;
			xm = (x + scroll_x) & (255);
			//ym = (line + scroll_y)%256;
			ym = (line + scroll_y) & (255);
			map_select = tilemap_select;
		}

		/* Which pixel is this tile on? Find its offset. */
		/* (y/8)*32 calculates the offset of the row the y coordinate is on.
		 * As 256/32 is 8, divide by 8 to map one to the other, this is the row number.
		 * Then multiply the row number by the width of a row, 32, to find the offset.
		 * Finally, add x/(256/32) to find the offset within that row.
		 */
		map_offset = (ym / 8) * 32 + xm / 8;

		//tile_num = mem_get_raw(0x9800 + map_select*0x400 + map_offset);
		tile_num = GBmem[0x9800 + map_select * 0x400 + map_offset];
		if (bg_tiledata_select)
			tile_addr = 0x8000 + tile_num * 16;
		else
			tile_addr = 0x9000 + ((signed char)tile_num) * 16;

		//GBmem
		//b1 = mem_get_raw(tile_addr + (ym & 7) * 2);
		//b2 = mem_get_raw(tile_addr + (ym & 7) * 2 + 1);
		b1 = GBmem[tile_addr + (ym & 7) * 2];
		b2 = GBmem[tile_addr + (ym & 7) * 2 + 1];

		mask = 128 >> (xm & 7);

		colour = (!!(b2&mask) << 1) | !!(b1&mask);
		//drawColorIndexToFrameBuffer(x,line,bgpalette[colour],b);
		b[offset + x] = bgpalette[colour];
	}
}

static void draw_sprites(unsigned char *b, int line, int nsprites, struct sprite *s)
{
	int i, offset = line * 160;
	unsigned char temp;

	for (i = 0; i < nsprites; i++)
	{
		unsigned int b1, b2, tile_addr, sprite_line, x;

		/* Sprite is offscreen */
		if (s[i].x < -7)
			continue;

		/* Which line of the sprite (0-7) are we rendering */
		sprite_line = s[i].flags & VFLIP ? (sprite_size ? 15 : 7) - (line - s[i].y) : line - s[i].y;

		/* Address of the tile data for this sprite line */
		tile_addr = 0x8000 + (s[i].tile * 16) + sprite_line * 2;

		/* The two bytes of data holding the palette entries */
		b1 = GBmem[tile_addr];
		b2 = GBmem[tile_addr + 1];

		/* For each pixel in the line, draw it */
		for (x = 0; x < 8; x++)
		{
			unsigned char mask, colour;
			unsigned char *pal;

			if ((s[i].x + x) >= 160)
				continue;

			mask = s[i].flags & HFLIP ? 128 >> (7 - x) : 128 >> x;
			colour = ((!!(b2&mask)) << 1) | !!(b1&mask);
			if (colour == 0)
				continue;

			pal = (s[i].flags & PNUM) ? sprpalette2 : sprpalette1;
			/* Sprite is behind BG, only render over palette entry 0 */
			if (s[i].flags & PRIO)
			{
				temp = b[offset + x + s[i].x];
				if (temp != colours[bgpalette[0]])
					continue;
			}
			//drawColorIndexToFrameBuffer(x + s[i].x,line,pal[colour],b);
			b[offset + x + s[i].x] = pal[colour];
		}
	}
}

void render_line(int line)
{
	int i, c = 0;

	struct sprite s[10];
	unsigned char *b = pixels;

	for (i = 0; i < 40; i++)
	{
		int y;

		y = GBmem[0xFE00 + (i << 2)] - 16;
		if (line < y || line >= y + 8 + (sprite_size * 8))
			continue;

