giltal/MakersPlatfrom/Drivers/ESP32_GB_EMU/ESP32_GB_EMU.cpp
		s[c].y = y;
		s[c].x = GBmem[0xFE00 + (i << 2) + 1] - 8;
		s[c].tile = GBmem[0xFE00 + (i << 2) + 2];
		s[c].flags = GBmem[0xFE00 + (i << 2) + 3];
		c++;

		if (c == 10)
			break;
	}

	if (c)
		sort_sprites(s, c);

	/* Draw the background layer */
	draw_bg_and_window(b, line);

	draw_sprites(b, line, c, s);
}

int count = 0;
unsigned long et, frames = 0;
#define SKIP_FRAMES	3
int skipFramesCounter = 0;

int lcd_cycle(void)
{
	int cycles = cpu_get_cycles();
	int this_frame, subframe_cycles;
	static int prev_line;

	this_frame = cycles % (70224 / 4);
	lcd_line = this_frame / (456 / 4);

	if (this_frame < 204 / 4)
		lcd_mode = 2;
	else if (this_frame < 284 / 4)
		lcd_mode = 3;
	else if (this_frame < 456 / 4)
		lcd_mode = 0;
	if (lcd_line >= 144)
		lcd_mode = 1;

	if ((lcd_line != prev_line) && (lcd_line < 144))
	{
		if (skipFramesCounter == SKIP_FRAMES)
		{
			render_line(lcd_line);
		}
	}

	if (ly_int && (lcd_line == lcd_ly_compare))
		interrupt(INTR_LCDSTAT);

	if ((prev_line == 143) && (lcd_line == 144))
	{
		interrupt(INTR_VBLANK);
		if (skipFramesCounter == SKIP_FRAMES)
		{
			skipFramesCounter = 0;
			flushFrameToLCD();
		}
		else
		{
			skipFramesCounter++;
		}
		frames++;
	}
	prev_line = lcd_line;

	return 1;
}

////// TIMER
static unsigned int prev_time;
static unsigned int elapsed;
static unsigned int ticks;

static unsigned char tac;
static unsigned int started;
static unsigned int speed;
static unsigned int counter;
static unsigned int divider;
static unsigned int modulo;

void timer_set_div(unsigned char v)
{
	(void)v;
	divider = 0;
}

unsigned char timer_get_div(void)
{
	return divider;
}

void timer_set_counter(unsigned char v)
{
	counter = v;
}

unsigned char timer_get_counter(void)
{
	return counter;
}

void timer_set_modulo(unsigned char v)
{
	modulo = v;
}

unsigned char timer_get_modulo(void)
{
	return modulo;
}

void timer_set_tac(unsigned char v)
{
	//int speeds[] = {64, 1, 4, 16};
	int speeds[] = { 1024, 16, 64, 256 };
	tac = v;
	started = v & 4;
	speed = speeds[v & 3];
}

unsigned char timer_get_tac(void)
{
	return tac;
}

static void timer_tick(void)
{
	/* 1/262144Hz has elapsed */
	ticks++;

	/* Divider updates at 16384Hz */
	if (ticks == 16)
	{
		divider++;
		ticks = 0;
	}

	if (!started)
		return;

	if (ticks == speed)
	{
		counter++;
		ticks = 0;
	}

	//if(counter == 0x100)
	if (counter >= 0x100)
	{
		interrupt(INTR_TIMER);
		counter = modulo;
	}
}

void timer_cycle(void)
{
	/* The amount of ticks since we last ran */
	unsigned int delta = cpu_get_cycles() - prev_time;
	prev_time = cpu_get_cycles();

	elapsed += delta * 4; /* 4 cycles to a timer tick */
	if (elapsed >= 16)
	{
		timer_tick();
		elapsed -= 16;	/* keep track of the time overflow */
	}
}

////// INTERRUPT
static int enabled;
static int pending;

/* Pending interrupt flags */
static unsigned int vblank;
static unsigned int lcdstat;
static unsigned int timer;
static unsigned int serial;
static unsigned int joypad;

/* Interrupt masks */
static unsigned int vblank_masked = 1;
static unsigned int lcdstat_masked = 1;
static unsigned int timer_masked = 1;
static unsigned int serial_masked = 1;
static unsigned int joypad_masked = 1;

/* Returns true if the cpu should be unhalted */
int inline interrupt_flush(void)
{
	/* Flush the highest priority interrupt and/or resume the cpu */
	if (pending == 2)
	{
		pending--;
		return 0;
	}

	pending = 0;

	/* There's a pending interrupt but interrupts are disabled, just resume the cpu */
	if (!enabled && ((vblank && !vblank_masked)
		|| (lcdstat && !lcdstat_masked)
		|| (timer && !timer_masked)
		|| (serial && !serial_masked)
		|| (joypad && !joypad_masked))
		)
		return 1;

	/* Interrupts are enabled - Check if any need to fire */
	if (vblank && !vblank_masked)
	{
		vblank = 0;
		cpu_interrupt(0x40);
	}
	else if (lcdstat && !lcdstat_masked)
	{
		lcdstat = 0;
		cpu_interrupt(0x48);
	}
	else if (timer && !timer_masked)
	{
		timer = 0;
		cpu_interrupt(0x50);
	}
	else if (serial && !serial_masked)
	{
		serial = 0;
		cpu_interrupt(0x58);
	}
	else if (joypad && !joypad_masked)
	{
		joypad = 0;
		cpu_interrupt(0x60);
	}

	return 0;
}

void interrupt_enable(void)
{
	enabled = 1;
	pending = 2;
}

void interrupt_disable(void)
{
	enabled = 0;
}

void interrupt(unsigned int n)
{
	/* Add this interrupt to pending queue */
	switch (n)
	{
	case INTR_VBLANK:
		vblank = 1;
		break;
	case INTR_LCDSTAT:
		lcdstat = 1;
		break;
	case INTR_TIMER:
		timer = 1;
		break;
	case INTR_SERIAL:
		serial = 1;
		break;
	case INTR_JOYPAD:
		joypad = 1;
		break;
	}

	/* If interrupts are already enabled, flush one now, otherwise wait for
	 * interrupts to be re-enabled.
	 */
	if (enabled)
		interrupt_flush();
}

unsigned char interrupt_get_IF(void)
{
	unsigned char mask = 0xE0;

	mask |= (vblank << 0);
	mask |= (lcdstat << 1);
	mask |= (timer << 2);
	mask |= (serial << 3);
	mask |= (joypad << 4);

	return mask;
}

void interrupt_set_IF(unsigned char mask)
{
	//	printf("IF set to %02x\n", mask);
	vblank = !!(mask & 0x01);
	lcdstat = !!(mask & 0x02);
	timer = !!(mask & 0x04);
	serial = !!(mask & 0x08);
	joypad = !!(mask & 0x10);

	if (enabled && mask)
		pending = 1;
}

unsigned char interrupt_get_mask(void)
{
	unsigned char mask = 0;

	mask |= (!vblank_masked << 0);
	mask |= (!lcdstat_masked << 1);
	mask |= (!timer_masked << 2);
	mask |= (!serial_masked << 3);
	mask |= (!joypad_masked << 4);

	return mask;
}

void interrupt_set_mask(unsigned char mask)
{
	vblank_masked = !(mask & 0x01);
	lcdstat_masked = !(mask & 0x02);
	timer_masked = !(mask & 0x04);
	serial_masked = !(mask & 0x08);
	joypad_masked = !(mask & 0x10);
}

////// CPU
#define set_HL(x) do {unsigned int macro = (x); c.L = macro&0xFF; c.H = macro>>8;} while(0)
#define set_BC(x) do {unsigned int macro = (x); c.C = macro&0xFF; c.B = macro>>8;} while(0)
#define set_DE(x) do {unsigned int macro = (x); c.E = macro&0xFF; c.D = macro>>8;} while(0)
#define set_AF(x) do {unsigned int macro = (x); c.F = macro&0xFF; c.A = macro>>8;} while(0)

#define get_AF() ((c.A<<8) | c.F)
#define get_BC() ((c.B<<8) | c.C)
#define get_DE() ((c.D<<8) | c.E)
#define get_HL() ((c.H<<8) | c.L)

/* Flags */
#define set_Z(x) c.F = ((c.F&0x7F) | ((x)<<7))
#define set_N(x) c.F = ((c.F&0xBF) | ((x)<<6))
#define set_H(x) c.F = ((c.F&0xDF) | ((x)<<5))
#define set_C(x) c.F = ((c.F&0xEF) | ((x)<<4))

#define flag_Z !!((c.F & 0x80))
#define flag_N !!((c.F & 0x40))
#define flag_H !!((c.F & 0x20))
#define flag_C !!((c.F & 0x10))

struct CPU {
	unsigned char H;
	unsigned char L;

	unsigned char D;
	unsigned char E;

	unsigned char B;
	unsigned char C;

	unsigned char A;
	unsigned char F;

