giltal/MakersPlatfrom/Drivers/ESP32_GB_EMU/ESP32_GB_EMU.cpp
	unsigned short SP;
	unsigned short PC;
	unsigned int cycles;
};

static struct CPU c;
static int is_debugged;
static int halted;

void cpu_init(void)
{
	set_AF(0x01B0);
	set_BC(0x0013);
	set_DE(0x00D8);
	set_HL(0x014D);
	c.SP = 0xFFFE;
	c.PC = 0x0100;
	c.cycles = 0;
}

static void RLC(unsigned char reg)
{
	unsigned char t, old;

	switch (reg)
	{
	case 0:	/* B */
		old = !!(c.B & 0x80);
		c.B = (c.B << 1) | old;
		set_C(old);
		set_Z(!c.B);
		break;
	case 1:	/* C */
		old = !!(c.C & 0x80);
		set_C(old);
		c.C = c.C << 1 | old;
		set_Z(!c.C);
		break;
	case 2:	/* D */
		old = !!(c.D & 0x80);
		set_C(old);
		c.D = c.D << 1 | old;
		set_Z(!c.D);
		break;
	case 3:	/* E */
		old = !!(c.E & 0x80);
		set_C(old);
		c.E = c.E << 1 | old;
		set_Z(!c.E);
		break;
	case 4:	/* H */
		old = !!(c.H & 0x80);
		set_C(old);
		c.H = c.H << 1 | old;
		set_Z(!c.H);
		break;
	case 5:	/* L */
		old = !!(c.L & 0x80);
		set_C(old);
		c.L = c.L << 1 | old;
		set_Z(!c.L);
		break;
	case 6:	/* (HL) */
		t = mem_get_byte(get_HL());
		old = !!(t & 0x80);
		set_C(old);
		t = t << 1 | old;
		mem_write_byte(get_HL(), t);
		set_Z(!t);
		break;
	case 7:	/* A */
		old = !!(c.A & 0x80);
		c.A = (c.A << 1) | old;
		set_C(old);
		set_Z(!c.A);
		break;
	}

	set_N(0);
	set_H(0);
}

static void RRC(unsigned char reg)
{
	unsigned char t, old;

	switch (reg)
	{
	case 0:	/* B */
		old = c.B & 1;
		set_C(old);
		c.B = c.B >> 1 | old << 7;
		set_Z(!c.B);
		break;
	case 1:	/* C */
		old = c.C & 1;
		set_C(old);
		c.C = c.C >> 1 | old << 7;
		set_Z(!c.C);
		break;
	case 2:	/* D */
		old = c.D & 1;
		set_C(old);
		c.D = c.D >> 1 | old << 7;
		set_Z(!c.D);
		break;
	case 3:	/* E */
		old = c.E & 1;
		set_C(old);
		c.E = c.E >> 1 | old << 7;
		set_Z(!c.E);
		break;
	case 4:	/* H */
		old = c.H & 1;
		set_C(old);
		c.H = c.H >> 1 | old << 7;
		set_Z(!c.H);
		break;
	case 5:	/* L */
		old = c.L & 1;
		set_C(old);
		c.L = c.L >> 1 | old << 7;
		set_Z(!c.L);
		break;
	case 6:	/* (HL) */
		t = mem_get_byte(get_HL());
		old = t;
		set_C(old);
		t = t >> 1 | old << 7;
		c.cycles += 2;
		mem_write_byte(get_HL(), t);
		set_Z(!t);
		break;
	case 7:	/* A */
		old = c.A & 1;
		set_C(old);
		c.A = c.A >> 1 | old << 7;
		set_Z(!c.A);
		break;
	}
	set_N(0);
	set_H(0);
}

static void RL(unsigned char reg)
{
	unsigned char t, t2;

	switch (reg)
	{
	case 0: /* B */
		t2 = flag_C;
		set_C(!!(c.B & 0x80));
		c.B = (c.B << 1) | !!(t2);
		set_Z(!c.B);
		break;
	case 1: /* C */
		t2 = flag_C;
		set_C(!!(c.C & 0x80));
		c.C = (c.C << 1) | !!(t2);
		set_Z(!c.C);
		break;
	case 2: /* D */
		t2 = flag_C;
		set_C(!!(c.D & 0x80));
		c.D = (c.D << 1) | !!(t2);
		set_Z(!c.D);
		break;
	case 3: /* E */
		t2 = flag_C;
		set_C(!!(c.E & 0x80));
		c.E = (c.E << 1) | !!(t2);
		set_Z(!c.E);
		break;
	case 4: /* H */
		t2 = flag_C;
		set_C(!!(c.H & 0x80));
		c.H = (c.H << 1) | !!(t2);
		set_Z(!c.H);
		break;
	case 5: /* L */
		t2 = flag_C;
		set_C(!!(c.L & 0x80));
		c.L = (c.L << 1) | !!(t2);
		set_Z(!c.L);
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		t2 = flag_C;
		set_C(!!(t & 0x80));
		t = (t << 1) | !!(t2);
		mem_write_byte(get_HL(), t);
		set_Z(!t);
		c.cycles += 2;
		break;
	case 7: /* A */
		t2 = flag_C;
		set_C(!!(c.A & 0x80));
		c.A = (c.A << 1) | t2;
		set_Z(!c.A);
		break;
	}

	set_N(0);
	set_H(0);
}

static void RR(unsigned char reg)
{
	unsigned char t, t2;

	switch (reg)
	{
	case 0:	/* B */
		t2 = flag_C;
		set_C(c.B & 1);
		c.B = (c.B >> 1) | t2 << 7;
		set_Z(!c.B);
		break;
	case 1: /* C */
		t2 = flag_C;
		set_C(c.C & 1);
		c.C = (c.C >> 1) | t2 << 7;
		set_Z(!c.C);
		break;
	case 2: /* D */
		t2 = flag_C;
		set_C(c.D & 1);
		c.D = (c.D >> 1) | t2 << 7;
		set_Z(!c.D);
		break;
	case 3: /* E */
		t2 = flag_C;
		set_C(c.E & 1);
		c.E = (c.E >> 1) | t2 << 7;
		set_Z(!c.E);
		break;
	case 4: /* H */
		t2 = flag_C;
		set_C(c.H & 1);
		c.H = (c.H >> 1) | t2 << 7;
		set_Z(!c.H);
		break;
	case 5: /* L */
		t2 = flag_C;
		set_C(c.L & 1);
		c.L = (c.L >> 1) | t2 << 7;
		set_Z(!c.L);
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		t2 = flag_C;
		set_C(t & 1);
		t = (t >> 1) | t2 << 7;
		set_Z(!t);
		mem_write_byte(get_HL(), t);
		c.cycles += 2;
		break;
	case 7: /* A */
		t2 = flag_C;
		set_C(c.A & 1);
		c.A = (c.A >> 1) | (t2 << 7);
		set_Z(!c.A);
		break;
	}
	set_N(0);
	set_H(0);
}

static void SLA(unsigned char reg)
{
	unsigned char t;

	switch (reg)
	{
	case 0: /* B */
		set_C(!!(c.B & 0x80));
		c.B = c.B << 1;
		set_Z(!c.B);
		break;
	case 1: /* C */
		set_C(!!(c.C & 0x80));
		c.C = c.C << 1;
		set_Z(!c.C);
		break;
	case 2: /* D */
		set_C(!!(c.D & 0x80));
		c.D = c.D << 1;
		set_Z(!c.D);
		break;
	case 3: /* E */
		set_C(!!(c.E & 0x80));
		c.E = c.E << 1;
		set_Z(!c.E);
		break;
	case 4: /* H */
		set_C(!!(c.H & 0x80));
		c.H = c.H << 1;
		set_Z(!c.H);
		break;
	case 5: /* L */
		set_C(!!(c.L & 0x80));
		c.L = c.L << 1;
		set_Z(!c.L);
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		set_C(!!(t & 0x80));
		t = t << 1;
		mem_write_byte(get_HL(), t);
		set_Z(!t);
		c.cycles += 2;
		break;
	case 7: /* A */
		set_C(!!(c.A & 0x80));
		c.A = c.A << 1;
		set_Z(!c.A);
		break;
	}

	set_H(0);
	set_N(0);
}

static void SRA(unsigned char reg)
{
	unsigned char old, t;

	switch (reg)
	{
	case 0: /* B */
		set_C(c.B & 1);
		old = c.B & 0x80;
		c.B = c.B >> 1 | old;
		set_Z(!c.B);
		break;
	case 1: /* C */
		set_C(c.C & 1);
		old = c.C & 0x80;
		c.C = c.C >> 1 | old;
		set_Z(!c.C);
		break;
	case 2: /* D */
		set_C(c.D & 1);
		old = c.D & 0x80;
		c.D = c.D >> 1 | old;
		set_Z(!c.D);
		break;
	case 3: /* E */
		set_C(c.E & 1);
		old = c.E & 0x80;
		c.E = c.E >> 1 | old;
		set_Z(!c.E);
		break;
	case 4: /* H */
		set_C(c.H & 1);
		old = c.H & 0x80;
		c.H = c.H >> 1 | old;
		set_Z(!c.H);
		break;
	case 5: /* L */
		set_C(c.L & 1);
		old = c.L & 0x80;
		c.L = c.L >> 1 | old;
		set_Z(!c.L);
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		set_C(t & 1);
		old = t & 0x80;
		t = t >> 1 | old;
		mem_write_byte(get_HL(), t);
		set_Z(!t);
		break;
	case 7: /* A */
		set_C(c.A & 1);
		old = c.A & 0x80;
		c.A = c.A >> 1 | old;
		set_Z(!c.A);
		break;
	}

	set_H(0);
	set_N(0);
}

static void SRL(unsigned char reg)
{
	unsigned char t;

	switch (reg)
	{
	case 0: /* B */
		set_C(c.B & 1);
		c.B = c.B >> 1;
		set_Z(!c.B);
		break;
	case 1: /* C */
		set_C(c.C & 1);
		c.C = c.C >> 1;
		set_Z(!c.C);
		break;
	case 2: /* D */
		set_C(c.D & 1);
		c.D = c.D >> 1;
		set_Z(!c.D);
		break;
	case 3: /* E */
		set_C(c.E & 1);
		c.E = c.E >> 1;
		set_Z(!c.E);
		break;
	case 4: /* H */
		set_C(c.H & 1);
		c.H = c.H >> 1;
		set_Z(!c.H);
		break;
	case 5: /* L */
		set_C(c.L & 1);
		c.L = c.L >> 1;
		set_Z(!c.L);
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		set_C(t & 1);
		t = t >> 1;
		mem_write_byte(get_HL(), t);
		set_Z(!t);
		c.cycles += 2;
		break;
	case 7: /* A */
		set_C(c.A & 1);
		c.A = c.A >> 1;
		set_Z(!c.A);
		break;
	}

	set_H(0);
	set_N(0);
}

static void SWAP(unsigned char reg)
{
	unsigned char t;

	switch (reg)
	{
	case 0: /* B */
		c.B = ((c.B & 0xF) << 4) | ((c.B & 0xF0) >> 4);
		c.F = (!c.B) << 7;
		break;
	case 1: /* C */
		c.C = ((c.C & 0xF) << 4) | ((c.C & 0xF0) >> 4);
		c.F = (!c.C) << 7;
		break;
	case 2: /* D */
		c.D = ((c.D & 0xF) << 4) | ((c.D & 0xF0) >> 4);
		c.F = (!c.D) << 7;
		break;
	case 3: /* E */
		c.E = ((c.E & 0xF) << 4) | ((c.E & 0xF0) >> 4);
		c.F = (!c.E) << 7;
		break;
	case 4: /* H */
		c.H = ((c.H & 0xF) << 4) | ((c.H & 0xF0) >> 4);
		c.F = (!c.H) << 7;
		break;
	case 5: /* L */
		c.L = ((c.L & 0xF) << 4) | ((c.L & 0xF0) >> 4);
		c.F = (!c.L) << 7;
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		t = ((t & 0xF) << 4) | ((t & 0xF0) >> 4);
		mem_write_byte(get_HL(), t);
		c.F = (!t) << 7;
		c.cycles += 2;
		break;
	case 7: /* A */
		c.A = ((c.A & 0xF) << 4) | ((c.A & 0xF0) >> 4);
		c.F = (!c.A) << 7;
		break;
	}
}

static void BITfunc(unsigned char bit, unsigned char reg)
{
	unsigned char t, f = 0 /* Make GCC happy */;

	switch (reg)
	{
	case 0: /* B */
		f = !(c.B & bit);
		break;
	case 1: /* C */
		f = !(c.C & bit);
		break;
	case 2: /* D */
		f = !(c.D & bit);
		break;
	case 3: /* E */
		f = !(c.E & bit);
		break;
	case 4: /* H */
		f = !(c.H & bit);
		break;
	case 5: /* L */
		f = !(c.L & bit);
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		f = !(t & bit);
		c.cycles += 1;
		break;
	case 7: /* A */
		f = !(c.A & bit);
		break;
	}

	set_Z(f);
	set_N(0);
	set_H(1);
}

static void RES(unsigned char bit, unsigned char reg)
{
	unsigned char t;

	switch (reg)
	{
	case 0: /* B */
		c.B &= ~bit;
		break;
	case 1: /* C */
		c.C &= ~bit;
		break;
	case 2: /* D */
		c.D &= ~bit;
		break;
	case 3: /* E */
		c.E &= ~bit;
		break;
	case 4: /* H */
		c.H &= ~bit;
		break;
	case 5: /* L */
		c.L &= ~bit;
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		t &= ~bit;
		mem_write_byte(get_HL(), t);
		c.cycles += 2;
		break;
	case 7: /* A */
		c.A &= ~bit;
		break;
	}
}

static void SET(unsigned char bit, unsigned char reg)
{
	unsigned char t;

	switch (reg)
	{
	case 0: /* B */
		c.B |= bit;
		break;
	case 1: /* C */
		c.C |= bit;
		break;
	case 2: /* D */
		c.D |= bit;
		break;
	case 3: /* E */
		c.E |= bit;
		break;
	case 4: /* H */
		c.H |= bit;
		break;
	case 5: /* L */
		c.L |= bit;
		break;
	case 6: /* (HL) */
		t = mem_get_byte(get_HL());
		t |= bit;
		mem_write_byte(get_HL(), t);
		c.cycles += 2;
		break;
	case 7: /* A */
		c.A |= bit;
		break;
	}
}

