giltal/MakersPlatfrom/Drivers/ESP32_GB_EMU/ESP32_GB_EMU.cpp
		set_H(((c.A - c.E) & 0xF) > (c.A & 0xF));
		set_N(1);
		set_C((c.A - c.E) < 0);
		c.PC += 1;
		c.cycles += 1;
		break;
	case 0xBC:	/* CP H */
		set_Z(c.A == c.H);
		set_H(((c.A - c.H) & 0xF) > (c.A & 0xF));
		set_N(1);
		set_C((c.A - c.H) < 0);
		c.PC += 1;
		c.cycles += 1;
		break;
	case 0xBD:	/* CP L */
		set_Z(c.A == c.L);
		set_H(((c.A - c.L) & 0xF) > (c.A & 0xF));
		set_N(1);
		set_C((c.A - c.L) < 0);
		c.PC += 1;
		c.cycles += 1;
		break;
	case 0xBE:	/* CP (HL) */
		t = mem_get_byte(get_HL());
		set_Z(c.A == t);
		set_H(((c.A - t) & 0xF) > (c.A & 0xF));
		set_N(1);
		set_C((c.A - t) < 0);
		c.PC += 1;
		c.cycles += 1;
		break;
	case 0xBF:	/* CP A */
		set_Z(1);
		set_H(0);
		set_N(1);
		set_C(0);
		c.PC += 1;
		c.cycles += 1;
		break;
	case 0xC0:	/* RET NZ */
		if (!flag_Z)
		{
			c.PC = mem_get_word(c.SP);
			c.SP += 2;
			c.cycles += 3;
		}
		else {
			c.PC += 1;
			c.cycles += 1;
		}
		break;
	case 0xC1:	/* POP BC */
		s = mem_get_word(c.SP);
		set_BC(s);
		c.SP += 2;
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xC2:	/* JP NZ, mem16 */
		if (flag_Z == 0)
		{
			c.PC = mem_get_word(c.PC + 1);
		}
		else {
			c.PC += 3;
		}
		c.cycles += 3;
		break;
	case 0xC3:	/* JP imm16 */
		c.PC = mem_get_word(c.PC + 1);
		c.cycles += 4;
		break;
	case 0xC4:	/* CALL NZ, imm16 */
		if (flag_Z == 0)
		{
			c.SP -= 2;
			mem_write_word(c.SP, c.PC + 3);
			c.PC = mem_get_word(c.PC + 1);
			c.cycles += 6;
		}
		else {
			c.PC += 3;
			c.cycles += 3;
		}
		break;
	case 0xC5:	/* PUSH BC */
		c.SP -= 2;
		mem_write_word(c.SP, get_BC());
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xC6:	/* ADD A, imm8 */
		t = mem_get_byte(c.PC + 1);
		set_C((c.A + t) >= 0x100);
		set_H(((c.A + t) & 0xF) < (c.A & 0xF));
		c.A += t;
		set_N(0);
		set_Z(!c.A);
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xC7:	/* RST 00 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0;
		c.cycles += 3;
		break;
	case 0xC8:	/* RET Z */
		if (flag_Z == 1)
		{
			c.PC = mem_get_word(c.SP);
			c.SP += 2;
			c.cycles += 3;
		}
		else {
			c.PC += 1;
			c.cycles += 1;
		}
		break;
	case 0xC9:	/* RET */
		c.PC = mem_get_word(c.SP);
		c.SP += 2;
		c.cycles += 3;
		break;
	case 0xCA:	/* JP z, mem16 */
		if (flag_Z == 1)
		{
			c.PC = mem_get_word(c.PC + 1);
		}
		else {
			c.PC += 3;
		}
		c.cycles += 3;
		break;
	case 0xCB:	/* RLC/RRC/RL/RR/SLA/SRA/SWAP/SRL/BIT/RES/SET */
		decode_CB(mem_get_byte(c.PC + 1));
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xCC:	/* CALL Z, imm16 */
		if (flag_Z == 1)
		{
			c.SP -= 2;
			mem_write_word(c.SP, c.PC + 3);
			c.PC = mem_get_word(c.PC + 1);
			c.cycles += 6;
		}
		else {
			c.PC += 3;
			c.cycles += 3;
		}
		break;
	case 0xCD:	/* call imm16 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 3);
		c.PC = mem_get_word(c.PC + 1);
		c.cycles += 6;
		break;
	case 0xCE:	/* ADC a, imm8 */
		t = mem_get_byte(c.PC + 1);
		i = c.A + t + flag_C >= 0x100;
		set_N(0);
		set_H(((c.A & 0xF) + (t & 0xF) + flag_C) >= 0x10);
		c.A = c.A + t + flag_C;
		set_C(i);
		set_Z(!c.A);
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xCF:	/* RST 08 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x0008;
		c.cycles += 4;
		break;
	case 0xD0:	/* RET NC */
		if (flag_C == 0)
		{
			c.PC = mem_get_word(c.SP);
			c.SP += 2;
			c.cycles += 3;
		}
		else {
			c.PC += 1;
			c.cycles += 1;
		}
		break;
	case 0xD1:	/* POP DE */
		s = mem_get_word(c.SP);
		set_DE(s);
		c.SP += 2;
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xD2:	/* JP NC, mem16 */
		if (flag_C == 0)
		{
			c.PC = mem_get_word(c.PC + 1);
		}
		else {
			c.PC += 3;
		}
		c.cycles += 3;
		break;
	case 0xD4:	/* CALL NC, mem16 */
		if (flag_C == 0)
		{
			c.SP -= 2;
			mem_write_word(c.SP, c.PC + 3);
			c.PC = mem_get_word(c.PC + 1);
			c.cycles += 6;
		}
		else {
			c.PC += 3;
			c.cycles += 3;
		}
		break;
	case 0xD5:	/* PUSH DE */
		c.SP -= 2;
		mem_write_word(c.SP, get_DE());
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xD6:	/* SUB A, imm8 */
		t = mem_get_byte(c.PC + 1);
		set_C((c.A - t) < 0);
		set_H(((c.A - t) & 0xF) > (c.A & 0xF));
		c.A -= t;
		set_N(1);
		set_Z(!c.A);
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xD7:	/* RST 10 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x0010;
		c.cycles += 4;
		break;
	case 0xD8:	/* RET C */
		if (flag_C == 1)
		{
			c.PC = mem_get_word(c.SP);
			c.SP += 2;
			c.cycles += 3;
		}
		else {
			c.PC += 1;
			c.cycles += 1;
		}
		break;
	case 0xDA:	/* JP C, mem16 */
		if (flag_C)
		{
			c.PC = mem_get_word(c.PC + 1);
		}
		else {
			c.PC += 3;
		}
		c.cycles += 3;
		break;
	case 0xDC:	/* CALL C, mem16 */
		if (flag_C == 1)
		{
			c.SP -= 2;
			mem_write_word(c.SP, c.PC + 3);
			c.PC = mem_get_word(c.PC + 1);
			c.cycles += 6;
		}
		else {
			c.PC += 3;
			c.cycles += 3;
		}
		break;
	case 0xD9:	/* RETI */
		c.PC = mem_get_word(c.SP);
		c.SP += 2;
		c.cycles += 4;
		interrupt_enable();
		break;
	case 0xDE:	/* SBC A, imm8 */
		t = mem_get_byte(c.PC + 1);
		b = flag_C;
		set_H(((t & 0xF) + flag_C) > (c.A & 0xF));
		set_C(t + flag_C > c.A);
		set_N(1);
		c.A -= (b + t);
		set_Z(!c.A);
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xDF:	/* RST 18 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x0018;
		c.cycles += 3;
		break;
	case 0xE0:	/* LD (FF00 + imm8), A */
		t = mem_get_byte(c.PC + 1);
		mem_write_byte(0xFF00 + t, c.A);
		c.PC += 2;
		c.cycles += 3;
		break;
	case 0xE1:	/* POP HL */
		i = mem_get_word(c.SP);
		set_HL(i);
		c.SP += 2;
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xE2:	/* LD (FF00 + C), A */
		s = 0xFF00 + c.C;
		mem_write_byte(s, c.A);
		c.PC += 1;
		c.cycles += 2;
		break;
	case 0xE5:	/* PUSH HL */
		c.SP -= 2;
		mem_write_word(c.SP, get_HL());
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xE6:	/* AND A, imm8 */
		t = mem_get_byte(c.PC + 1);
		set_N(0);
		set_H(1);
		set_C(0);
		c.A = t & c.A;
		set_Z(!c.A);
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xE7:	/* RST 20 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x20;
		c.cycles += 4;
		break;
	case 0xE8:	/* ADD SP, imm8 */
		i = mem_get_byte(c.PC + 1);
		set_Z(0);
		set_N(0);
		set_C(((c.SP + i) & 0xFF) < (c.SP & 0xFF));
		set_H(((c.SP + i) & 0xF) < (c.SP & 0xF));
		c.SP = c.SP + (signed char)i;
		c.PC += 2;
		c.cycles += 4;
		break;
	case 0xE9:	/* JP HL */
		c.PC = get_HL();
		c.cycles += 1;
		break;
	case 0xEA:	/* LD (mem16), a */
		s = mem_get_word(c.PC + 1);
		mem_write_byte(s, c.A);
		c.PC += 3;
		c.cycles += 4;
		break;
	case 0xEE:	/* XOR A, imm8 */
		c.A ^= mem_get_byte(c.PC + 1);
		c.F = (!c.A) << 7;
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xEF:	/* RST 28 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x28;
		c.cycles += 4;
		break;
	case 0xF0:	/* LD A, (FF00 + imm8) */
		t = mem_get_byte(c.PC + 1);
		c.A = mem_get_byte(0xFF00 + t);
		c.PC += 2;
		c.cycles += 3;
		break;
	case 0xF1:	/* POP AF */
		s = mem_get_word(c.SP);
		set_AF(s & 0xFFF0);
		c.SP += 2;
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xF2:	/* LD A, (FF00 + c) */
		c.A = mem_get_byte(0xFF00 + c.C);
		c.PC += 1;
		c.cycles += 2;
		break;
	case 0xF3:	/* DI */
		c.PC += 1;
		c.cycles += 1;
		interrupt_disable();
		break;
	case 0xF5:	/* PUSH AF */
		c.SP -= 2;
		mem_write_word(c.SP, get_AF());
		c.PC += 1;
		c.cycles += 3;
		break;
	case 0xF6:	/* OR A, imm8 */
		c.A |= mem_get_byte(c.PC + 1);
		c.F = (!c.A) << 7;
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xF7:	/* RST 30 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x30;
		c.cycles += 4;
		break;
	case 0xF8:	/* LD HL, SP + imm8 */
		i = mem_get_byte(c.PC + 1);
		set_N(0);
		set_Z(0);
		set_C(((c.SP + i) & 0xFF) < (c.SP & 0xFF));
		set_H(((c.SP + i) & 0xF) < (c.SP & 0xF));
		set_HL(c.SP + (signed char)i);
		c.PC += 2;
		c.cycles += 3;
		break;
	case 0xF9:	/* LD SP, HL */
		c.SP = get_HL();
		c.PC += 1;
		c.cycles += 2;
		break;
	case 0xFA:	/* LD A, (mem16) */
		s = mem_get_word(c.PC + 1);
		c.A = mem_get_byte(s);
		c.PC += 3;
		c.cycles += 4;
		break;
	case 0xFB:	/* EI */
		interrupt_enable();
		// printf("Interrupts enabled, IE: %02x\n", interrupt_get_mask());
		c.PC += 1;
		c.cycles += 1;
		break;
	case 0xFE:	/* CP a, imm8 */
		t = mem_get_byte(c.PC + 1);
		set_Z(c.A == t);
		set_N(1);
		set_H(((c.A - t) & 0xF) > (c.A & 0xF));
		set_C(c.A < t);
		c.PC += 2;
		c.cycles += 2;
		break;
	case 0xFF:	/* RST 38 */
		c.SP -= 2;
		mem_write_word(c.SP, c.PC + 1);
		c.PC = 0x0038;
		c.cycles += 4;
		break;
	default:
		printf("Unhandled opcode %02X at %04X\n", b, c.PC);
		return 0;
		break;
	}

	return 1;
}
